/* 10.6 Дан массив. Проверить, одинаковые ли элементы в массиве
   вывести результат true или false в консоль.
*/
let arr = [3, 3, 3];
let isEqual = true;
for(let i=0; i < arr.length; i++){
    if (arr[0] !== arr[i]){
        isEqual = false;
        break;
    }
}
console.log("All elements are equal is: " + isEqual);

//Using the .every
let allEqual = arr => arr.every(val => val === arr[0]);
let result = allEqual([3, 4, 3]);
console.log(result);

// В данной задаче сравнение между элементами должно быть строгим (=== вместо ==), чтобы сравнение было не только по значению, но и по типу. Иначе элементы 1 и "1" считаются одинаковыми, что не совсем правильно. Во 2-м варианте (с every) сделано верно, поэтому задание засчитала.
// В 1-м варианте задача решена не верно. Вы сравниваете соседние элементы между собой, и переменная isEqual перезаписывается на каждой итерации цикла. Правильная логика была бы следующая: сранивать все элементы массива с первым и записывать в isEqual значение false только в случае, если какой-то из элементов не равен первому, т.к. это будет означать, что не все элементы в массиве одинаковые. Выше исправила ошибки в первом варианте